In [1]:
# Alinhamento de Dados

import pandas as pd
import numpy as np
from pandas import DataFrame, Series

In [2]:
serie_1 = Series([0, 1, 2], index = ['A', 'B', 'C'])

In [3]:
serie_1

A    0
B    1
C    2
dtype: int64

In [4]:
serie_2 = Series([3,4,5,6], index = ['A', 'B', 'C', 'D'])

In [5]:
serie_2

A    3
B    4
C    5
D    6
dtype: int64

In [6]:
# O que vai acontecer se unirmos as duas Series?

serie_3 = serie_1 + serie_2

In [7]:
serie_3

A    3.0
B    5.0
C    7.0
D    NaN
dtype: float64

In [11]:
# Pandas adicionou o valor onde os índices corresponderam. Onde não correspondeu ele colocou NaN (nulo).

# Será que com DataFrames isso também acontece?

dframe_1 = DataFrame(np.arange(4).reshape((2,2)), columns = list('AB'), index = ['NYC', 'LA'])

In [12]:
dframe_1

     A  B
NYC  0  1
LA   2  3

In [13]:
dframe_2 = DataFrame(np.arange(9).reshape((3,3)), columns = list('ADC'), index = ['NYC', 'SF', 'LA'])

In [14]:
dframe_2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [15]:
dframe_1 + dframe_2 # Somou onde corresponderam os índices e as colunas.

       A   B   C   D
LA   8.0 NaN NaN NaN
NYC  0.0 NaN NaN NaN
SF   NaN NaN NaN NaN

In [16]:
# E se quisermos substituir os valores nulos?

dframe_1.add(dframe_2, fill_value = 0)

       A    B    C    D
LA   8.0  3.0  8.0  7.0
NYC  0.0  1.0  2.0  1.0
SF   3.0  NaN  5.0  4.0

In [17]:
dframe_1

     A  B
NYC  0  1
LA   2  3

In [19]:
dframe_2

     A  D  C
NYC  0  1  2
SF   3  4  5
LA   6  7  8

In [20]:
serie_3 = dframe_2.ix[0]

C:\Users\lucca.matos\anaconda3\lib\site-packages\ipykernel_launcher.py:1: DeprecationWarning:
.ix is deprecated. Please use
.loc for label based indexing or
.iloc for positional indexing

See the documentation here:
http://pandas.pydata.org/pandas-docs/stable/indexing.html#ix-indexer-is-deprecated
  """Entry point for launching an IPython kernel.

In [21]:
serie_3

A    0
D    1
C    2
Name: NYC, dtype: int32

In [22]:
dframe_2 - serie_3

     A  D  C
NYC  0  0  0
SF   3  3  3
LA   6  6  6